[
  {
    "id": "20240521_pc_subsystem_testing",
    "description": "Comprehensive testing plan for Main PC and PC2 Subsystem, covering local validation, integration, cross-machine sync, and failover scenarios based on the provided blueprint.",
    "todos": [
      {
        "text": "STAGE 1: Local PC2 Validation (Main PC only)\n\n• Spin up docker-compose.pc2-local.yml to run all seven PC2 stacks locally.\n• Run the pytest suite using files like tests/conftest.py, tests/test_inter_service.py, and tests/test_resource_allocation.py.\n• Collect and verify coverage/trace output in the ObservabilityHub.\n\n──────────────────────────────────\nMAHALAGANG PAALALA: Tiyaking pumasa ang lahat ng local tests sa yugtong ito. Ito ang pundasyon na nagpapatunay na gumagana nang tama ang PC2 services sa isang isolated environment bago subukan ang integration sa Main PC.",
        "done": true
      },
      {
        "text": "STAGE 2: Integration Simulation (Main PC + PC2 locally)\n\n• Bring up the full Main-PC docker-compose (12 groups) alongside the PC2 compose file from Stage 1.\n• Execute integration tests to validate:\n  - Service discovery between the two stacks (e.g., utility_cpu ↔ pc2_utility_suite).\n  - End-to-end tasks that traverse both machine stacks, mocked via localhost.\n\n──────────────────────────────────\nMAHALAGANG PAALALA: Ang layunin dito ay mahuli ang mga isyu sa configuration at communication sa pagitan ng Main PC at PC2 stacks bago pa man ito i-deploy sa magkahiwalay na physical machines. Kumpirmahin na nag-uusap nang tama ang lahat ng serbisyo.",
        "done": true
      },
      {
        "text": "STAGE 3: Cross-Machine Pre-Sync Validation\n\n• I-deploy ang PC2 Docker images at compose file sa PC2 machine.\n• Mula sa Main PC, patakbuhin ang scripts/cross_machine_network_check.sh para kumpirmahin ang network connectivity sa lahat ng kinakailangang ports.\n• I-verify na ang ObservabilityHub sa Main PC ay nakakatanggap ng data mula sa PC2 machine.\n\n──────────────────────────────────\nMAHALAGANG PAALALA: Ito ang unang pagsubok na kinasasangkutan ng dalawang magkahiwalay na makina. Ang tagumpay sa yugtong ito ay nangangahulugang mayroon nang basic network reachability. Huwag magpatuloy kung may pumalyang network check.",
        "done": false
      },
      {
        "text": "STAGE 4: Post-Sync Continuous Validation\n\n• Patakbuhin ang pytest suite nang remote sa PC2 machine at i-export ang mga resulta.\n• I-trigger ang Main-PC integration suite gamit ang remote URLs ng PC2 services.\n• Magsagawa ng load-balancing tests (e.g., weighted round-robin checks) at simulated latency injection para subukan ang system resiliency.\n\n──────────────────────────────────\nMAHALAGANG PAALALA: Dito sinusubok ang performance at katatagan ng distributed system sa ilalim ng mas makatotohanang kondisyon. Ang matagumpay na load-balancing at resiliency tests ay kritikal bago ideklarang production-ready ang system.",
        "done": false
      },
      {
        "text": "STAGE 5: Failover Scenarios\n\n• Magsagawa ng 'chaos testing': random na patayin ang mga container sa bawat machine upang matiyak na gumagana ang mga retry at circuit-breaker.\n• I-simulate ang isang network partition (gamit ang iptables DROP rules) at i-validate na ang system ay nagde-degrade nang maayos (graceful degradation) sa halip na mag-crash nang tuluyan.\n\n──────────────────────────────────\nMAHALAGANG PAALALA: Ito ang huling yugto ng pagsubok sa katatagan ng system. Kinukumpirma nito na ang arkitektura ay kayang humarap sa mga hindi inaasahang pagpalya. Ito ang pinakamahalagang hakbang upang matiyak ang isang 'bulletproof' na setup.",
        "done": false
      }
    ],
    "status": "in_progress",
    "created": "2024-05-21T10:00:00Z",
    "updated": "2025-08-03T15:45:16.629172+08:00"
  }
]